; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	image0 - mode
	thermograph1 - mode
	image3 - mode
	infrared2 - mode
	thermograph4 - mode
	Star0 - direction
	GroundStation1 - direction
	Star3 - direction
	GroundStation5 - direction
	Star6 - direction
	Star4 - direction
	Star2 - direction
	Star7 - direction
	Planet8 - direction
	Phenomenon9 - direction
	Phenomenon10 - direction
	Phenomenon11 - direction
	Planet12 - direction
	Phenomenon13 - direction
	Phenomenon14 - direction
)
(:init
	(supports instrument0 image0)
	(calibration_target instrument0 Star4)
	(supports instrument1 thermograph1)
	(supports instrument1 image3)
	(calibration_target instrument1 Star6)
	(supports instrument2 infrared2)
	(calibration_target instrument2 Star2)
	(calibration_target instrument2 Star6)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon10)
	(supports instrument3 thermograph4)
	(supports instrument3 image0)
	(calibration_target instrument3 Star2)
	(calibration_target instrument3 Star4)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star3)
)
(:goal (and
	(pointing satellite0 Star6)
	(have_image Star7 image3)
	(have_image Planet8 image3)
	(have_image Phenomenon9 thermograph4)
	(have_image Phenomenon10 thermograph4)
	(have_image Phenomenon11 image0)
	(have_image Planet12 image0)
	(have_image Phenomenon13 thermograph4)
	(have_image Phenomenon14 infrared2)
))

)

; plan
1. (turn_to satellite0 star2 phenomenon10)
   deleted: (pointing satellite0 phenomenon10)
   added: (pointing satellite0 star2)
   goals met: 0 of 9
2. (switch_on instrument2 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument2)
   goals met: 0 of 9
3. (calibrate satellite0 instrument2 star2)
   added: (calibrated instrument2)
   goals met: 0 of 9
4. (turn_to satellite0 phenomenon14 star2)
   deleted: (pointing satellite0 star2)
   added: (pointing satellite0 phenomenon14)
   goals met: 0 of 9
5. (take_image satellite0 phenomenon14 instrument2 infrared2)
   added: (have_image phenomenon14 infrared2)
   goals met: 1 of 9
6. (turn_to satellite0 star6 phenomenon14)
   deleted: (pointing satellite0 phenomenon14)
   added: (pointing satellite0 star6)
   goals met: 2 of 9
7. (switch_off instrument2 satellite0)
   deleted: (power_on instrument2)
   added: (power_avail satellite0)
   goals met: 2 of 9
8. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 2 of 9
9. (calibrate satellite0 instrument1 star6)
   added: (calibrated instrument1)
   goals met: 2 of 9
10. (switch_on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 2 of 9
11. (turn_to satellite0 planet8 star6)
   deleted: (pointing satellite0 star6)
   added: (pointing satellite0 planet8)
   goals met: 1 of 9
12. (take_image satellite0 planet8 instrument1 image3)
   added: (have_image planet8 image3)
   goals met: 2 of 9
13. (turn_to satellite0 star7 planet8)
   deleted: (pointing satellite0 planet8)
   added: (pointing satellite0 star7)
   goals met: 2 of 9
14. (take_image satellite0 star7 instrument1 image3)
   added: (have_image star7 image3)
   goals met: 3 of 9
15. (turn_to satellite0 star6 star7)
   deleted: (pointing satellite0 star7)
   added: (pointing satellite0 star6)
   goals met: 4 of 9
16. (turn_to satellite1 star2 star3)
   deleted: (pointing satellite1 star3)
   added: (pointing satellite1 star2)
   goals met: 4 of 9
17. (calibrate satellite1 instrument3 star2)
   added: (calibrated instrument3)
   goals met: 4 of 9
18. (turn_to satellite1 phenomenon10 star2)
   deleted: (pointing satellite1 star2)
   added: (pointing satellite1 phenomenon10)
   goals met: 4 of 9
19. (take_image satellite1 phenomenon10 instrument3 thermograph4)
   added: (have_image phenomenon10 thermograph4)
   goals met: 5 of 9
20. (turn_to satellite1 phenomenon11 phenomenon10)
   deleted: (pointing satellite1 phenomenon10)
   added: (pointing satellite1 phenomenon11)
   goals met: 5 of 9
21. (take_image satellite1 phenomenon11 instrument3 image0)
   added: (have_image phenomenon11 image0)
   goals met: 6 of 9
22. (turn_to satellite1 phenomenon13 phenomenon11)
   deleted: (pointing satellite1 phenomenon11)
   added: (pointing satellite1 phenomenon13)
   goals met: 6 of 9
23. (take_image satellite1 phenomenon13 instrument3 thermograph4)
   added: (have_image phenomenon13 thermograph4)
   goals met: 7 of 9
24. (turn_to satellite1 phenomenon9 phenomenon13)
   deleted: (pointing satellite1 phenomenon13)
   added: (pointing satellite1 phenomenon9)
   goals met: 7 of 9
25. (take_image satellite1 phenomenon9 instrument3 thermograph4)
   added: (have_image phenomenon9 thermograph4)
   goals met: 8 of 9
26. (turn_to satellite1 planet12 phenomenon9)
   deleted: (pointing satellite1 phenomenon9)
   added: (pointing satellite1 planet12)
   goals met: 8 of 9
27. (take_image satellite1 planet12 instrument3 image0)
   added: (have_image planet12 image0)
   goals met: 9 of 9
